개념

객체란

'주체' 의 반대 , 의사나 행위의 '대상(Object)'
실존(독점적,배타적 공간을 차지)하는 모든 대상(사물)
자바에서는 인스턴스(Instance)라고도 부른다
객체 기본구조

속성(Attribute)

객체를 표현하는 데이터값
저장의 대상
멤버변수 , 필드 , 상태값이라고도 부른다

기능(Method)

객체의 행위를 구현하는 로직(알고리즘)
구현의 대상
매서드 , 기능 , 함수 , 행위라고도 부른다

객체지향Object-Oriented Programming, OOP)이란

프로그래밍에서 필요한 데이터를 추상화 시켜 상태와 행위를 가진 객체로 만들고, 객체들간의 상호작용을 통해 로직을 구성하는 프로그래밍 방법

클래스란

객체를 정의하기 위해 선언된 자료형
건물의 설계도면 정도로 이해하면 좋음

JAVA 메모리 구조 
스택 영역 : 메서드 호출시 할당되는 영역 / {}가 끝나는 시점에서 할당한 메모리 반환
지역변수 / 매개변수
생성시점 : 메서드 호출시 | 소멸시점 : 메서드 종료시(return)
클래스(메서드)영역 : 공유 영역 / 프로그램 종료시까지 유지
생성자 메서드 / 일반 메서드 / static 매서드 / static 변수
생성시점 : 프로그램 시작시 | 소멸시점 : 프로그램 종료시
힙 영역 : 객체 생성시 사용되는 공간 / 참조변수 연결시까지(GG에 의해 제거됨) | 참고-객체소멸시점 |
생성시점 : new 예약어 사용시 | 소멸시점 : 참조변수 연결해제시 자동 소멸(GG에 의한)
기본코드해석하기(Scanner sc = new Scanner(System.in)
